УРВ_файловая/src/Catalogs/Новости/Новости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Новости</name>
  <comment>Новости информационного центра</comment>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Пожелания</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Публиковать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сервисы</name>
    <attributes>
      <name>Сервис</name>
      <type>
        <types>CatalogRef.Сервисы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Компоненты</name>
    <attributes>
      <name>Компонент</name>
      <type>
        <types>CatalogRef.КомпонентыСервиса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УРВ_файловая/src/Catalogs/Новости/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьНовость(Заголовок, Объект = Неопределено, Приоритет = 3, СрокАктуальности = 7) Экспорт
    
    Новость = Справочники.Новости.СоздатьЭлемент();
    Новость.Наименование = Заголовок;
    Новость.ДатаСоздания = ТекущаяУниверсальнаяДата();
    Новость.ДатаАктуальности = СрокАктуальности * 24 * 60 * 60;
    Новость.Объект = Объект;
    Для каждого Строка Из Объект.Сервисы Цикл
    	НоваяСтрока = Новость.Сервисы.Добавить();
        НоваяСтрока.Сервис = Строка.Сервис;
    КонецЦикла; 
    Для каждого Строка Из Объект.Компоненты Цикл
    	НоваяСтрока = Новость.Компоненты.Добавить();
        НоваяСтрока.Компонент = Строка.Компонент;
    КонецЦикла; 
    Новость.Приоритет = Приоритет;
    Новость.Публиковать = Истина;
    
    Новость.Записать();
	
КонецПроцедуры

#КонецОбласти     

#КонецЕсли
